{
  "</tool_call>": 151658,
  "<tool_call>": 151657,
  "<|audio_comp_end|>": 151667,
  "<|audio_comp_span|>": 151666,
  "<|audio_comp_start|>": 151665,
  "<|audio_gen_end|>": 151670,
  "<|audio_gen_span|>": 151669,
  "<|audio_gen_start|>": 151668,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|text_cond_end|>": 151671,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
